"[{\"No.\":1,\"Exhibitor Name\":\"ACTO GMBH\",\"Company Profile\":\"ACTO GmbH (Germany)\\nACTO GmbH is a German company that specializes in the production of pharmaceutical products, including disinfectants, wound care products, cosmetics, food supplements, and medical devices. The company was founded in 1990 and is headquartered in Braunschweig, Germany, with additional branches in Bavaria, Baden-W\\u00fcrttemberg, and Istanbul.\\nACTO GmbH's product range is focused on the biopharma sector, providing a wide variety of high-quality products that are standardized according to GMP, CE-93\\/42\\/EEC, ISO 13485, and ISO 9001 standards. The company has an expert R&D team and a technology R&D laboratory that can perform all necessary chemical and microbiological tests to ensure the quality and safety of its products.\\nAttending a pharma event would be beneficial for individuals interested in sourcing reliable and specialized pharmaceutical products, as ACTO GmbH is a reputable supplier in the biopharma industry. The company's expertise in disinfection, wound care, and medical devices, as well as its commitment to quality and regulatory compliance, make it a valuable partner for pharmaceutical companies and researchers.\"},{\"No.\":2,\"Exhibitor Name\":\"BALLAND MESSE-SERVICE GMBH\",\"Company Profile\":\"Balland Messe- Service (Germany).                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         Balland Messe-Service GmbH is a company that specializes in the implementation of joint company stands for the participation of federal and state ministries at international trade fairs. It was founded in the year 2001 and its head quarter is loacated in Cologne, Germany.Balland Messe-Service GmbH is an expert in organizing participation at international trade fairs, particularly in the pharmaceutical and biotechnology industries. The company helps clients set up joint company stands at events like CPhI Worldwide, a leading international pharmaceutical trade show. Attendees of pharmaceutical events should meet with representatives from Balland Messe-Service GmbH to learn about the company's expertise in organizing successful trade fair participations.The company can provide valuable insights and assistance in planning and executing an effective trade fair presence, which is crucial for companies looking to showcase their products, network with industry peers, and generate new business opportunities. \"},{\"No.\":3,\"Exhibitor Name\":\"BALTACON\",\"Company Profile\":\"BALTACON (Northen Europe): has over 30 years of Experience.\\nBALTACON provides solutions for clinical trials and healthcare needs worldwide.Baltacon's range of products includes brand and generic pharmaceuticals, non-prescription medicine, over-the-counter medicines, veterinary products, and more. \\nThe company aims to make pharmaceutical products more accessible for patients both on the national market and in areas around the world. At a pharma event, it would be beneficial to meet with individuals from Baltacon for the following reasons:\\n1. Baltacon provides customized pharmaceutical supply solutions\\n2. The company has a wide range of expertise\\n3.Baltacon has a global reach\\n4.By discussing their services and experience, attendees can explore potential collaborations or learn about best practices in pharmaceutical sourcing and supply\"},{\"No.\":4,\"Exhibitor Name\":\"BCWORLD PHARM CO., LTD.\",\"Company Profile\":\"BCWORLD PHARM CO., LTD. (South Korea); Founded in 1980.\\nBCWORLD PHARM CO., LTD. is a technology-driven pharmaceutical company specializes in formulation and process development, enabling it to provide high-quality generic drugs. They possess global-standard production facilities and are committed to realizing the value of life through their pharmaceutical products. \\nAttendees Should Meet Individuals from BCWORLD PHARM CO., LTD. at a Pharma Event:\\n1. Expertise in Formulation and Process Development\\n2.Global Standards and Quality Assurance\\n3. Innovative Solutions\\n4. Networking Opportunities.  By engaging with BCWORLD PHARM CO., LTD. at a pharma event, attendees can gain valuable insights into the latest advancements in pharmaceutical development and quality assurance, as well as establish connections that can benefit their own work in the biopharma space.\"},{\"No.\":5,\"Exhibitor Name\":\"BECTON DICKINSON HOLDINGS PTE. LTD\",\"Company Profile\":\"BECTON DICKINSON HOLDINGS PTE. LTD (Singapore); founded in 2011\\nBecton Dickinson Holdings Pte. Ltd. (BD) is a global medical technology company that develops and manufactures a wide range of medical devices, instrument systems, and reagents. The company has a significant presence in various countries, including the United States, Europe, and Asia, and partners with organizations worldwide to address global health challenges.\\nAttendees Should Meet Individuals from Becton Dickinson Holdings Pte. Ltd.:\\n1. Innovative Technology\\n2. Global Reach\\n3. Industry Expertise\\n4. Networking Opportunities\\n5. Product Showcase\\nBy meeting with individuals from Becton Dickinson Holdings Pte. Ltd., attendees can gain valuable insights into the latest advancements in medical technology, expand their professional network, and stay updated on industry trends and best practices.\"},{\"No.\":6,\"Exhibitor Name\":\"CAREGEN CO.,LTD.\",\"Company Profile\":\"CAREGEN CO.,LTD. (South Korea): founded in 2001; Global Biotechnology Company\\nThe company has developed over 600 different functional peptides over the past 23 years, which have expanded the applications of biotechnology into areas such as cosmeceuticals, Class III medical devices, food supplements, and pharmaceuticals.\\nCaregen is a leading company in the field of biomimetic peptide synthesis and the manufacture of cosmeceuticals and dermal fillers. Some of their key product lines include solutions for anti-aging, anti-pigmentation, anti-inflammation, lipolysis, and hair nutrition. The company distributes its products both domestically in South Korea and to overseas markets.\\nIndividuals attending a pharmaceutical event should consider meeting with representatives from Caregen Co., Ltd. to learn more about their innovative peptide-based solutions and explore potential collaborations or business opportunities. As a global leader in peptide research and development, Caregen could be an interesting partner for pharmaceutical companies looking to leverage advanced biotechnology for new drug or treatment discoveries.\"},{\"No.\":7,\"Exhibitor Name\":\"CAREPLUSONE CO.,LTD.\",\"Company Profile\":\"CAREPLUSONE CO.,LTD. (Korea)\\nThe company has dedicated partnerships with reliable alliance partners from Japan, Northeast Asia, Southeast Asia, the Middle East, and Europe. The company is dedicated to creating a world where humans, animals, and nature coexist.\\nIndividuals attending a pharma event should meet with CarePlusOne representatives to learn about the company's state-of-the-art pharmaceutical products and explore potential partnerships or collaborations, as CarePlusOne is actively seeking to expand its reach and introduce innovative solutions to the global biopharma market. \\r\\n\"},{\"No.\":8,\"Exhibitor Name\":\"CHEMISCHE FABRIK BERG GMBH\",\"Company Profile\":\"CHEMISCHE FABRIK BERG GMBH (Germany); Founded in 1953.\\nChemische Fabrik Berg GmbH is a global supplier of Active Pharmaceutical Ingredients (APIs) for human and veterinary use. Chemische Fabrik Berg operates a state-of-the-art facility in Bitterfeld, Germany, which produces APIs and Key Intermediates according to Good Manufacturing Practice (GMP) guidelines. The plant was approved by German authorities in 2000 and inspected by the FDA in 2002.\\nAttendees Should Meet Individuals from Chemische Fabrik Berg GmbH:\\n1. Custom Manufacturing\\n2. Regulatory Services\\n3. Product Development\\n4. Quality and Compilance ;Meeting individuals from Chemische Fabrik Berg GmbH can provide valuable insights into custom manufacturing, regulatory compliance, and product development in the biopharma space.\"},{\"No.\":9,\"Exhibitor Name\":\"CURTEC\",\"Company Profile\":\"CURTEC (Rijen, Netherlands); Founded in 1991\\nCurTec is a leading manufacturer of high-performance plastic packaging solutions for the pharmaceutical and specialty chemicals industries.The company designs, produces, and distributes robust containers for the storage and transportation of active ingredients, excipients, intermediates, and solid dosage forms such as tablets and capsules.The company has been GMP certified since 2016, ensuring that its products are manufactured and controlled consistently to quality standards.\\nAttendees of pharmaceutical events should consider meeting with CurTec representatives to learn about the company's innovative packaging solutions that help ensure the integrity and safety of medicines.\"},{\"No.\":10,\"Exhibitor Name\":\"DISCH AG\",\"Company Profile\":\"DISCH AG (Swiss Company); Founded in 1903\\nThe company initially focused on manufacturing candies, cookies, and waffles. In 1933, DISCH introduced the \\\"Sportmint\\\" - the first nutraceutical product in history, which combined a refreshing toffee with added vitamin C. \\nSince 2003, DISCH has shifted its focus to pharmaceutical products, which now make up 80% of its product range. DISCH develops and manufactures products according to customer specifications, adhering to recognized standards such as GMP, at its facilities in Switzerland.\\nAttending a pharma event would be beneficial for those interested in DISCH's expertise in pharmaceutical confectionery formulations and manufacturing. As a pioneer in nutraceuticals and a trusted CDMO, DISCH can offer valuable insights and potential collaboration opportunities to pharmaceutical and supplement companies looking to develop innovative, high-quality chewable or lozenge-based products.\"},{\"No.\":11,\"Exhibitor Name\":\"DONGKOOK PHARMACEUTICAL CO.,LTD.\",\"Company Profile\":\"DONGKOOK PHARMACEUTICAL CO.,LTD. (South Korea); Founded in 1968\\nspecializes in the research, development, and production of various pharmaceutical products. The company is known for its OTC products with high brand value in Korea, as well as its development of therapeutic products such as anesthetics, contrast media, and anti-cancer agents.he company currently exports finished products, medical devices, and APIs to 17 countries around the world.\\nAttending a pharma event, such as CPhI, would be an excellent opportunity to meet with representatives from DONGKOOK PHARMACEUTICAL CO.,LTD. for several reasons:\\n1. Networking\\n2. Product Showcase\\n3. Industry insights\\n4. Establishing Realtionships\"},{\"No.\":12,\"Exhibitor Name\":\"DOTT. BONAPACE & C. SRL\",\"Company Profile\":\"DOTT. BONAPACE & C. SRL (Cusano Milanino, Italy); Founded in 1946\\nDOTT. BONAPACE & C. SRL offers a wide range of products and services, including:\\nLab scale machines for R&D\\nAutomatic and semi-automatic capsule filling machines\\nSachet filling machines\\nSuppositories filling machines\\nConsumables and raw materials\\nAttending a pharmaceutical event, meeting with individuals from DOTT. BONAPACE & C. SRL can be highly beneficial for several reasons:\\n1. Networking\\n2. Product Demonstartions\\n3. Customized Solutions\\nIn conclusion, DOTT. BONAPACE & C. SRL is a leading player in the pharmaceutical equipment manufacturing space, offering a range of innovative solutions to its clients worldwide. Attending pharmaceutical events and connecting with their representatives can be a valuable opportunity for networking, learning about the latest industry trends, and exploring potential collaborations.\"},{\"No.\":13,\"Exhibitor Name\":\"E-CELL CO., LTD.\",\"Company Profile\":\"E-CELL CO., LTD. (Korea); \\nThe company is the first single-use bag manufacturer in Korea, and its products are widely used in bioreactors, fermentation processes, and other biopharma applications.\\nThe E-Cell System contributes to advancements in fermentation technology in the following ways:\\n1. Whole-Cell Simulation Capabilities\\n2. Incorporation of Experimental Data\\n3. Modeling Flexibility and Extensibility\\n4. Distributed Simulation Capabilities\\nIndividuals attending a pharma event should consider meeting with representatives from E-CELL CO., LTD. to learn more about how their single-use bag solutions can benefit fermentation-based biopharma production.\"},{\"No.\":14,\"Exhibitor Name\":\"ENTECH SL CO., LTD.\",\"Company Profile\":\"ENTECH SL CO., LTD. (Italy); Founded on 24 March 1993; \\nBiopharma company that operates in the pharmaceutical industry, provides packaging materials, drug delivery solutions, pharmaceutical machinery, and industrial IoT monitoring systems to the pharmaceutical industry.\\nthe company appears to be an exhibitor at the upcoming CPhI South East Asia 2024 trade show, where they will be showcasing their products and services to attendees.\\nIndividuals attending the pharma event should consider meeting with ENTECH SL CO., LTD. representatives to learn more about their biopharma offerings and explore potential business opportunities. The company has experienced professionals who can deliver customized solutions and provide onsite support to clients\"},{\"No.\":15,\"Exhibitor Name\":\"EVERZINC BELGIUM SA\",\"Company Profile\":\"EVERZINC BELGIUM SA; Founded on 09 March 2015\\nEverZinc Belgium SA is a global leader in the production of zinc chemicals, with three main product lines: fine zinc powders, zinc oxide, and zinc powders for batteries. The company is a major producer of zinc oxide in Europe and the sole manufacturer of zinc oxide as an active pharmaceutical ingredient (API).\\nAttendees of pharmaceutical events like CPHI should meet with representatives from EverZinc Belgium SA to learn about their high-purity, GMP-certified zinc oxide products and their ability to develop customized solutions. As the sole European manufacturer of zinc oxide API and a major producer of zinc chemicals, EverZinc can be a valuable partner for pharmaceutical and personal care companies looking for reliable, quality-assured raw materials.\"},{\"No.\":16,\"Exhibitor Name\":\"GLOBAL CLEANROOMS PTY LTD.\",\"Company Profile\":\"GLOBAL CLEANROOMS PTY LTD. (Australian company); Registered on 29 November 2012\\nGlobal Cleanrooms Pty Ltd is a recognized leader in the design, construction, project management, and maintenance of controlled environments, including cleanrooms, for the biotechnology and biopharma industries. The company specializes in creating customized cleanroom solutions that meet the stringent requirements of the biotech and pharmaceutical sectors. The services that they offer are:\\n1. Design and Construction\\n2. Project Management\\n3. Management and operation\\n4. Customized Solutions\\nIndividuals attending a pharma event should meet with representatives from Global Cleanrooms Pty Ltd to discuss their expertise in delivering turnkey cleanroom solutions.\"},{\"No.\":17,\"Exhibitor Name\":\"HAWO GMBH\",\"Company Profile\":\"HAWO GMBH (Germany); Founded in 1975\\nThe company is known for its innovative and sustainable packaging solutions to medical and pharmaceutical industries.\\nAttending a pharma event presents an excellent opportunity to meet with representatives from hawo GmbH. As a leading player in the biopharma packaging space, hawo can offer valuable insights into the latest trends, technologies, and best practices in sterile packaging. By engaging with hawo's experts, attendees can learn about innovative solutions for improving hygiene standards, ensuring patient safety, and optimizing packaging processes.\\r\\nMoreover, hawo's participation in major pharma events, such as CPHI South East Asia and Compamed, demonstrates their commitment to staying at the forefront of the industry and connecting with potential partners and customers\"},{\"No.\":18,\"Exhibitor Name\":\"INNATE S.R.L.\",\"Company Profile\":\"INNATE S.R.L. (Novi Ligure, Italy);Established in the year 2004\\nprovides a range of services including development, manufacturing, and private labeling of pharmaceutical products such as pre-filled syringes, vials, ovules, and aluminum tubes. The company is committed to quality and compliance with industry standards, and utilizes cutting-edge technologies to meet the latest market needs.\\r\\nIndividuals attending a pharma event should consider meeting with representatives from INNATE S.R.L. as the company can be a valuable partner for biopharma companies. As a CDMO, INNATE S.R.L. can support the development and manufacturing of a wide range of pharmaceutical products, potentially helping to accelerate innovation and bring new therapies to patients.\"},{\"No.\":19,\"Exhibitor Name\":\"JEIL PHARMACEUTICAL CO., LTD.\",\"Company Profile\":\"JEIL PHARMACEUTICAL CO., LTD. (South Korea); Founded in 1959\\nJEIL PHARMACEUTICAL  that develops and distributes a range of pharmaceutical products, including solid pharmaceuticals, injections, finished drugs, and antibiotics for the treatment of oncology, urology, neuropsychiatry, and endocrinology. The company has also developed a transdermal delivery system technology.\\nAttending a pharma event would be beneficial for meeting with representatives from JEIL PHARMACEUTICAL CO., LTD. as the company is actively involved in the global pharmaceutical industry. They could discuss potential partnership opportunities, licensing agreements, or explore ways to collaborate on product development or distribution.\"},{\"No.\":20,\"Exhibitor Name\":\"JSC LEKHIM\",\"Company Profile\":\"JSC LEKHIM (Ukraine); Founded in 1992\\nJSC LEKHIM ranking among the top 5 pharmaceutical manufacturers in the country.\\nLekhim specializes in the production of a wide range of generic drugs across various therapeutic areas, including cardiology, gastroenterology, gynecology, urology, neurology, and more. The company has a strong focus on innovation, investing significantly in R&D and modernizing its production facilities.\\nSome key facts about JSC Lekhim:\\n1. Ranks 1st in sales of enzyme formulations, suppository formulations, and pelletized formulations among Ukrainian pharmaceutical manufacturers\\n2. Ranks 3rd in antibiotics sales and 5th in overall sales volume among Ukrainian pharmaceutical manufacturers\\n3. Operates multiple production facilities across Ukraine, as well as subsidiaries in Lithuania and Uzbekistan\\n4. Recently signed a sublicense agreement with the Medicines Patent Pool to produce a generic version of Shionogi's COVID-19 oral antiviral treatment, helping to increase access in low- and middle-income countries\\nIndividuals attending a pharmaceutical event should consider meeting with representatives from JSC Lekhim to learn more about the company's capabilities, product portfolio, and plans for future growth and expansion. As a leading Ukrainian pharmaceutical manufacturer, Lekhim could be an interesting partner or supplier for companies looking to enter or expand in the Ukrainian market.\"},{\"No.\":21,\"Exhibitor Name\":\"KHIDI\",\"Company Profile\":\"KHIDI (Korea Health Industry Development Institute, Founded on January 2000) is a government-affiliated institution that supports the growth and international competitiveness of Korea's healthcare industry. \\nKHIDI's key roles include:\\n1. Facilitating Korea's growth as a global biopharmaceutical powerhouse \\n2. Supporting the development of the medical device industry in Korea \\n3. Promoting international cooperation and overseas advancement of the Korean healthcare industry \\n4. Investing in innovative companies to support their R&D process and help them seek external investment opportunities \\nFor those attending a pharma event, meeting with representatives from KHIDI would be valuable for several reasons:\\n1. KHIDI has deep market insights and knowledge of the local Korean healthcare landscape, which they can share to help companies understand opportunities in the Korean market \\n2. KHIDI aims to enhance the healthcare industry, bring innovation, and accelerate the growth of the Korean biopharmaceutical and medical device sectors \\n3. KHIDI can provide guidance and support to companies looking to enter or expand in the Korean healthcare market, leveraging their expertise and government connections\"},{\"No.\":22,\"Exhibitor Name\":\"LACTOMASON CO., LTD.\",\"Company Profile\":\"LACTOMASON CO., LTD. (South Korea); Founded in 2007\\nLACTOMASON CO., LTD specializes in probiotics and the nutraceutical industry. The company deals in probiotic finished products and is a biopharma company.\\nSomeone attending a pharma event should meet individuals from LACTOMASON CO., LTD. because the company has specialized techniques for extraction, refinement, and fermentation of natural ingredients. As a biopharma company focused on probiotics, LACTOMASON CO., LTD. can provide insights and potential collaborations in the rapidly growing probiotic and nutraceutical space.\"},{\"No.\":23,\"Exhibitor Name\":\"LAMBDA BIOLOGICS GMBH\",\"Company Profile\":\"Lambda Biologics GmbH ; founded year 2012\\nLAMBDA BIOLOGICS GMBH is a biopharma company that provides state-of-the-art animal-free solutions for pre-clinical testing. They offer a comprehensive range of resources, including clinically relevant patient-derived organoid models, to support scientific research and drug development. The company emphasizes ethics and innovation, providing cruelty-free alternatives and cutting-edge technologies that deliver accurate and reliable results. Lambda Biologics also offers cost-effective solutions and streamlined processes to accelerate research outcomes.\\nSomeone attending a pharma event should meet individuals from Lambda Biologics GmbH because:\\n1. Ethical Solutions\\n2. Innovative technologies\\n3. Global reach\\n4. Expertise in Biosimilar Develoment\\nMeeting Lambda Biologics GmbH at a pharma event would be beneficial for attendees seeking to stay updated on the latest advancements in pre-clinical testing and to explore potential collaborations for more efficient and ethical research methods.\"},{\"No.\":24,\"Exhibitor Name\":\"LGC STANDARDS\",\"Company Profile\":\"LGC STANDARDS; Founded in 2011\\nLGC Standards is a leading global manufacturer and provider of reference materials and proficiency testing schemes for the pharmaceutical and biotech industries. They have a long history in measurement science and producing reference materials for a wide range of applications.\\nIn the pharmaceutical space, LGC Standards offers a range of reference materials essential for accurate analytical measurement and quality control, ensuring sound decisions are made based on reliable data. Their Mikromol brand provides primary reference standards for active pharmaceutical ingredients (APIs), excipients, and impurities to help detect degradation products and ensure regulatory compliance.\\nAttending pharma events is an excellent opportunity to meet with LGC Standards representatives and learn how their reference materials and proficiency testing schemes can support your drug discovery, development and manufacturing processes. Their experts can provide insights into the latest industry trends, regulatory requirements, and how their solutions can help you bring safer, higher-quality medicines to market\"},{\"No.\":25,\"Exhibitor Name\":\"MEDICA KOREA CO., LTD.\",\"Company Profile\":\"MEDICA KOREA CO., LTD. (Seoul, South Korea); Established in the year 1976.\\nMedica Korea Co., Ltd. is a pharmaceutical company operates in the Medicinal and Botanical Manufacturing industry. The company aims to expand its therapeutic market and provide high-quality products to its customers. Medica Korea uses safe materials and raw materials to manufacture its products.\\nAttend Pharma Events to Meet Medica Korea Representatives helps in:\\n1.Learn about Medica Korea's latest drug research and development efforts in the biopharma space\\n2. Discuss potential partnerships or collaborations to bring new drugs to market\\n3. Gain insights into the South Korean pharmaceutical market and regulatory landscape\\n4. Network with industry professionals and explore business opportunities\\nBy attending pharma events and meeting with Medica Korea representatives, attendees can stay informed about the company's activities, explore partnership opportunities, and gain valuable industry knowledge.\"},{\"No.\":26,\"Exhibitor Name\":null,\"Company Profile\":null}]"