"[{\"S No\":1.0,\"Name\":\"Adeline Mariska\",\"Title\":\"Business Development Manager - SEAP\",\"Company\":\"SGS Vitrology\",\"Company Info\\/Profile Info\":\"SGS Vitrology (Glasgow): As a world leader in biopharmaceutical testing services, we offer you a comprehensive range of biologics safety testing, including virology, cell and molecular biology, as well as microbiology and electron microscopy. As a result, we can help you to ensure product safety and meet your regulatory requirements.\",\"Other Details\":\"Exhibitor, Booth Number: F26, Country: UNITED KINGDOM, Biopharmaceuticals: Assays; Biomanufacturing; Cell and Gene therapy; CHO and cell lines; Molecular Biology, Contract Services - Analytical & Lab Services: Method Validation, Bio Services: Bio Services; Others, Contract Services - Contract Services: Analytical development; Cell-culture development; Others\"},{\"S No\":null,\"Name\":\"Adisa Charoenthanatnan\",\"Title\":\"Sales Manager\",\"Company\":\"Filterfine (Thailand) CO., LTD\",\"Company Info\\/Profile Info\":\"Filterfine Group are committed to innovating solutions for the challenges in Life Sciences, Semiconductor, Hard Disk Drive, and Electronic industries. Leveraging our extensive expertise in research and product development, we are prepared to introduce new methods and problem-solving strategies across diverse industrial sectors. Our objective is to enhance value and efficiency for both current and future clients.\",\"Other Details\":\"Exhibitor, Booth Number: M60, Country: THAILAND, Biopharmaceuticals: Analytical Chemistry, Analytical Methods, Bio process technologies, Contract Services - Analytical & Lab Services: Method Development, Method Validation, Contract Services - Bio Services: Analytical Chemistry, Analytical Methods, Custom Manufacturing: Purification and Separation Techniques, Laboratory and Analytical Equipment: Analytical Equipment, Cleaning equipment, Instrumental analysis, Media\"},{\"S No\":null,\"Name\":\"Alla Kot\",\"Title\":\"Chief Rep\",\"Company\":\"Farmak International\",\"Company Info\\/Profile Info\":\"Founded in 1925, Farmak International is a global pharmaceutical company specializing in research, development, manufacturing & marketing of generics. With facilities in Ukraine and Spain, it has a strong global presence. Company operates >10 commercial offices in Switzerland, EU, Ukraine, Central & Pacific Asia, Middle East, demonstrating its commitment to delivering quality medicines worldwide.\",\"Other Details\":\"Exhibitor. Booth Number: N08. Country: SWITZERLAND. Finished Dosage Forms: Capsules; Creams \\/ Lotions \\/ Ointments; Drop; Injectables; Out-licensing; Soft tabs; Sprays; Suspensions; Syrups; Tablets.\"},{\"S No\":null,\"Name\":\"Alexander Meitinger\",\"Title\":\"Account Manager\",\"Company\":\"PureFlavourGmbH\",\"Company Info\\/Profile Info\":\"Pure Flavour is a contract manufacturer in Germany for private and white label products in the health and nutrition sector. Since 2018 our production is IFS certified to fulfill the high international requirements. Together with brands from the beverage and sports nutrition & supplements sectors, we want to develop and establish the food and supplements of the future.\",\"Other Details\":\"Exhibitor. Booth Number: F36. Country: GERMANY. Custom Manufacturing: Custom Manufacturing (general category); Custom Manufacturing of Dosage Form Drugs. Finished Dosage Forms: Capsules; Drop; Powders; Sprays; Syrups. Natural Extracts: Nutraceutical and cosmeceutical ingredients. Pharmaceutical Packaging: Fill finish and packaging, Labelling. Additional Natural Extracts: Cosmeceutical Ingredients.\"},{\"S No\":null,\"Name\":\"Amit Sharma\",\"Title\":\"GM\",\"Company\":\"SMR Automotive System India Ltd\",\"Company Info\\/Profile Info\":\"SMHS, part of Samvardhana Motherson, pioneers Next-Gen Pharma solutions merging automotive practices with life sciences innovations. With automation, ML\\/AI, and digitalization, we elevate manufacturing efficiency. Trusted by industry leaders like Sun Pharma and Abbott, our commitment to excellence drives transformative partnerships.\",\"Other Details\":\"Exhibitor. Booth Number: C23. Country: INDIA. Biopharmaceuticals: Analytical Methods; Process validation; Technology and software. Contract Services - Bio Services: Process validation; Technology and software. Contract Services - Contract Services: Analytical development; Computer software; Contract manufacturing; Data services; Process optimization. Contract Services - Pre Clinical Trials, Clinical Trials Stages 1-4, CRO, Clinical Data: Statistical analysis.\"},{\"S No\":null,\"Name\":\"Aman Palrecha\",\"Title\":\"Director\",\"Company\":\"Lake Chemicals Pvt. Ltd.\",\"Company Info\\/Profile Info\":\"Lake Chemicals was established in 1992, with an experience of API manufacturing over 3 decades. Our core area of specialization is in the CNS therapeutic category of APIs with a few products from the anti-diarhoea & anti-glaucoma range. Lake is an EU-GMP certified facility with 8 CEPs \\/ COSs (Certificates of Suitability). We regularly export to over 65+ countries across 5 continents. Our strong emphasis on quality and strong regulatory support has earned us the recognition and approval from several originators such as those for Alprazolam, Clonazepam, Loperamide & Lorazepam. Our DMFs have been registered in several countries and highly regulated markets such as Indonesia, Australia, Brazil, Argentina, Canada, Vietnam, Malaysia, Bangladesh and several European countries such as Spain, Belgium, the Netherlands, Portugal and many more. Our vision is to become a world leader in the CNS therapeutic category of drugs and do our bit in contributing towards a healthier society.\",\"Other Details\":\"Exhibitor. Booth Number: L23. Country: INDIA. Animal Health: Animal Health. Custom Manufacturing: Exclusive synthesis of API\\u2019s. Generic APIs: Generic Synthetic APIs. Intermediates, Fine and Specialty Chemicals: Advanced Intermediates.\"},{\"S No\":null,\"Name\":\"Ampawan Jaruboon\",\"Title\":\"Marketing\",\"Company\":\"Entech Si Co., Ltd\",\"Company Info\\/Profile Info\":\"Entech SI Co., Ltd., a subsidiary of Entech Group, has served the Thai pharmaceutical industry for over ten years. We are the exclusive agent for G.F. of Italy, a leading provider of high-technology machinery for sterile and non-sterile filling and visual inspection applications. Founded in 1979, G.F. boasts a 40-year of quality and innovation, headquartered in Rubbiano (PR), Italy.\",\"Other Details\":\"Exhibitor. Booth Number: C41. Country: THAILAND. Pharmaceutical Packaging: Cartons, Fill finish and packaging, Labelling, Secondary Packaging.\"},{\"S No\":null,\"Name\":\"Amy Channing\",\"Title\":\"Sales Manager\",\"Company\":\"SHANGHAI RELIANCE MACHINERY CO., LTD\",\"Company Info\\/Profile Info\":\"Reliance Machinery Company is a professional designer and manufacturer that provides a wide range of liquid filling and capping machines, labeling machines, shrink machines, and contract turnkey projects for various industries. Our solutions are widely used in the Pharmaceutical, Diagnostic, Nutraceutical, Cosmetic, and CBD industries.\",\"Other Details\":\"Exhibitor. Booth Number: K23. Country: CHINA.\"},{\"S No\":null,\"Name\":\"Amy Lyu\",\"Title\":\"General Manager\",\"Company\":\"HUANGSHAN BONSUN PHARMACEUTICALS CO., LTD.\",\"Company Info\\/Profile Info\":\"Bonsun is a high-tech enterprise engaged in researching and manufacturing high-grade Polyvinylpyrrolidone (PVP) series. The annual production capacity is 3000mt, including PVP K, PVP-A, PVPP, and PVP-I. Bonsun ensures products comply with international quality standards and holds certificates like DMF, CEP, ISO9001, ISO14001, ISO22000, Kosher, and Halal.\",\"Other Details\":\"Exhibitor. Booth Number: J30. Country: CHINA. Fine Chemicals (general category); Excipients - Antimicrobial Preservatives, Antioxidants, Coating Agents, Emulsifying\\/Solubilising Agents, Glidants, Suspending\\/Viscosity Increasing Agents, Tablet Fillers \\/ Binders, Disintegrating agent; Intermediates, Fine and Specialty Chemicals - Fine Chemicals (general category).\"},{\"S No\":null,\"Name\":\"Anil Arya\",\"Title\":\"Partner\",\"Company\":\"Sabiha Research & Development LLP\",\"Company Info\\/Profile Info\":\"Founded in 2020, Sabiha Research & Development LLP specializes in synthesizing pharmaceutical impurities. They provide reference standards & certified traceable working standards as per EP, BP, USP. Exporting globally with a stock of over 10,000 molecules.\",\"Other Details\":\"Exhibitor. Booth Number: K40. Country: INDIA. Custom Manufacturing - Exclusive Synthesis of Fine Chemicals;Custom Manufacturing\\/Exclusive Synthesis of apis.\"},{\"S No\":null,\"Name\":\"Annie An\",\"Title\":\"Operation Department \\u00b7 Marketing Manager\",\"Company\":\"ECHEMI\",\"Company Info\\/Profile Info\":\"ECHEMI is the professional digital cross-border chemical B2B platform, aiming at helping our platform buyers analyze the market and purchase high-quality chemicals, and in the meanwhile, assisting platform suppliers to promote their superior products. Echemi.com is offering decent services and products to more than 22,000 suppliers and more than 110,000 international buyers.\",\"Other Details\":\"Exhibitor. Booth Number: E40. Country: CHINA. Contract Services - Data services; Excipients - Antioxidants, Solvents; Generic APIs - Generic Peptides; Intermediates, Fine and Specialty Chemicals - Advanced Intermediates, Fine Chemicals (general category), Natural Extracts - Plant extracts.\"},{\"S No\":null,\"Name\":\"Anon Unchit-anusorn\",\"Title\":\"Executive Assistant\",\"Company\":\"REAXO PHARMA & CHEM Co., Ltd.\",\"Company Info\\/Profile Info\":\"REAXO PHARMA & CHEM Co., Ltd. - Business type: CDMO - Location: Rayong Province, Thailand - Overall Area: Approx 9 Hectares - Main Products: Fine Chemicals, Intermediates in Pharmaceutical & Agricultural, etc. - Current Services: Contract development, Custom Manufacturing, Analytical and Quality Control - Future Services: Process optimization and scale-up, Regulatory support and compliance\",\"Other Details\":\"Exhibitor. Booth Number: P41. Country: THAILAND. Contract Services - Analytical development, Blending, Chemical synthesis\\/analysis, Contract manufacturing, contract packaging; Custom Manufacturing - API Contract Manufacturing, Custom Manufacturing (general category), Custom Manufacturing\\/Exclusive Synthesis of Fine Chemicals, Exclusive synthesis of API\\u2019s, Purification and Separation Techniques; Intermediates, Fine and Specialty Chemicals - Fine Chemicals (general category), Specialty Chemicals.\"},{\"S No\":null,\"Name\":\"APURVA PATIL\",\"Title\":\"DGM\",\"Company\":\"MurliKrishna Exports Pvt Ltd\",\"Company Info\\/Profile Info\":\"Murlikrishna Exports Pvt Ltd is an ISO 9001-2008 Certified Pharmaceutical company operating internationally since 1999, specializing in pharmaceutical healthcare. We have expanded globally in countries like Spain, Switzerland, Mexico, Iran, Syria, Argentina, Hong Kong, Vietnam, Korea, and China.\",\"Other Details\":\"Exhibitor. Booth Number: K26. Country: INDIA. Excipients - Flavours and Perfumes, Glidants, Sweetening Agents, Tablet Fillers \\/ Binders; Natural Extracts - Herbal extracts, Nutraceutical and cosmeceutical ingredients, Plant extracts.\"},{\"S No\":null,\"Name\":\"Areeda Vongsiri\",\"Title\":\"Regulatory Affairs Pharmacist\",\"Company\":\"Community Pharmacy Pubic Company Limited\",\"Company Info\\/Profile Info\":\"Community Pharmacy Public Company Limited is one of the leading manufacturers and distributors of pharmaceuticals in Thailand. Established in 1983, they focus on providing high-quality medicines at reasonable prices.\",\"Other Details\":\"Exhibitor. Booth Number: M03. Country: THAILAND. Finished Dosage Forms - Capsules, Creams \\/ Lotions \\/ Ointments, Powders, Sprays, Syrups, Tablets.\"},{\"S No\":null,\"Name\":\"Ava Jiang\",\"Title\":\"Marketing Manager\",\"Company\":\"Zhejiang Tailin Scitech Co.,Ltd.\",\"Company Info\\/Profile Info\":\"Founded in 2002, Zhejiang Tailin Scitech Co.,Ltd. is a leading company in the life science field, specializing in technological innovation and strong manufacturing ability.\",\"Other Details\":\"Exhibitor. Booth Number: B36. Country: CHINA. Biopharmaceuticals - Biomanufacturing, Biopharmaceuticals (general category), Cell and Gene therapy. Custom Manufacturing (general category). Laboratory and Analytical Equipment.\"},{\"S No\":null,\"Name\":\"Beibei Zhang\",\"Title\":\"Sales Manager\",\"Company\":\"SHANDONG NEW TIME PHARMACEUTICAL CO., LTD.\",\"Company Info\\/Profile Info\":\"Shandong New Time Pharmaceutical Co., Ltd., also known as Lunan Pharma, is a leading generic pharmaceutical company in China. Ranked 25th in Top100 pharmaceutical companies in China 2023.\",\"Other Details\":\"Exhibitor. Booth Number: R23. Country: CHINA. Finished Dosage Forms - Capsules, Drop, Injectables, Sprays, Suppositories, Tablets.\"},{\"S No\":null,\"Name\":\"Bella Zhang\",\"Title\":\"Sales Manager\",\"Company\":\"Sichuan Hui Li Industry Co., Ltd.\",\"Company Info\\/Profile Info\":\"Helee Group is a professional large-scale manufacturer of pharmaceutical packaging material. Established in 1989. Main products include PVC, PVDC, Aluminium Foil, Alu-Alu Foil, Tropical Foil, Strip Foil, Suppository Film&Foil, Sachet Film(Pouches), etc. As a result of our management team, advanced equipment, quality products, and good after-sales service, we have gained a global sales network.\",\"Other Details\":\"Exhibitor. Booth Number: B26. Country: CHINA. Pharmaceutical Packaging - Aluminium Foils, Anti-forgery and security solutions, Blister Packaging, Cartons, Closures, Contract Packing, Packaging Materials and Components, Pharmaceutical Pouches, Plastic Packaging, Primary Packaging, Secondary Packaging, Sustainable Packaging.\"},{\"S No\":null,\"Name\":\"Ben Chen\",\"Title\":\"Sales Manager\",\"Company\":\"KUNMING JIDA PHARMACEUTICAL CO., LTD.\",\"Company Info\\/Profile Info\":\"Kunming Jida Pharmaceutical Co., Ltd., established in 1993 and restructured into a joint-stock company in 2011, is a leading chemical drug enterprise in Yunnan Province mainly engaged in chemical drug R & D, production, and sales. Chemicals are mainly generic drugs, covering the treatment fields of urinary tract, cardio cerebrovascular, digestive liver disease, and skeletal muscle.\",\"Other Details\":\"Exhibitor. Booth Number: K33. Country: CHINA. Contract Services - Marketing Services. Finished Dosage Forms - Capsules, Gel caps, Injectables, Powders, Suspensions, Tablets, Transdermal patches.\"},{\"S No\":null,\"Name\":\"Benno Staeheli\",\"Title\":\"Chief Sales Officer\",\"Company\":\"Disch AG\",\"Company Info\\/Profile Info\":\"DISCH is a European leader in confectionery technology and has expanded this expertise over the years. Today, we are a contract manufacturer for companies in the pharmaceutical industry and for customers in the dietary supplement market, produced exclusively in Switzerland.\",\"Other Details\":\"Exhibitor. Booth Number: M46. Country: SWITZERLAND. Contract Services - Contract manufacturing, contract packaging, formulation development, others. Custom Manufacturing - General category. Finished Dosage Forms - Others. Pharmaceutical Packaging - Blister packaging, cartons, fill finish and packaging, pharmaceutical pouches, primary packaging, secondary packaging.\"},{\"S No\":null,\"Name\":\"Bhavesh Kumar Maganbhai Dudhat\",\"Title\":\"OWNER\",\"Company\":\"GROWEQUAL\",\"Company Info\\/Profile Info\":\"GROWEQUAL specializes in contract manufacturing of Nutraceutical products such as Multivitamin tablets, vitamin capsules, Effervescent Tablets, Protein powder, Soft gel capsules, Vitamin-C Tablets, Syrups. Third-party manufacturing for brands with in-house customized packing facility and export permission available.\",\"Other Details\":\"Exhibitor. Booth Number: J23. Country: INDIA. Contract Services - Contract manufacturing, others. Natural Extracts - Others.\"},{\"S No\":null,\"Name\":\"Bruce Lee\",\"Title\":\"Department Manager\",\"Company\":\"SINOPED LIAOYANG CO., LTD\",\"Company Info\\/Profile Info\":\"SINOPED was established in 1947 and the factory covers an area of 60,000m\\u00b2. Its headquarters is located in Liaoning Province. Products include pharmaceutical packaging and machinery.\",\"Other Details\":\"Exhibitor. Booth Number: E49. Country: CHINA.\"},{\"S No\":null,\"Name\":\"Bo Kyung Kim\",\"Title\":\"Export Manager\",\"Company\":\"Optus Pharmaceutical Co Ltd\",\"Company Info\\/Profile Info\":\"OPTUS pharmaceutical specializes in total eye care solutions, focusing on the eye health of customers globally.\",\"Other Details\":\"Exhibitor. Booth Number: H42. Country: SOUTH KOREA.\"},{\"S No\":null,\"Name\":\"Business Development Pharmacist\",\"Title\":\"Business Development Pharmacist\",\"Company\":\"Pond's Chemical Thailand R.O.P.\",\"Company Info\\/Profile Info\":\"Pond Chemical Thailand is a well-established pharmaceutical manufacturer and distributor with over 50 years of experience.\",\"Other Details\":\"Exhibitor. Booth Number: L08. Country: THAILAND. Business Development Department\"},{\"S No\":null,\"Name\":\"Cepie Cahyana\",\"Title\":\"Sales Supervisor\",\"Company\":\"Altinex, PT\",\"Company Info\\/Profile Info\":\"PT. Altinex is a Tablet Compacting Tools manufacturer for pharmaceutical industries based in Bandung, Indonesia.\",\"Other Details\":\"Exhibitor. Booth Number: C40. Country: INDONESIA. Pharmaceutical Packaging: Drug Delivery Systems, Fill finish and packaging, Medical Devices and medical packaging, Primary Packaging.\"},{\"S No\":null,\"Name\":\"Ceyda Isci\",\"Title\":\"Management Assistance\",\"Company\":\"Acto GmbH\",\"Company Info\\/Profile Info\":\"ACTO GmbH is specialized in manufacturing, sales and marketing of disinfectants, wound care products, personal care & hygiene products, industrial cleaners, food supplements, cosmetics, veterinary products, agriculture & livestock fertilizers, and face masks.\",\"Other Details\":\"Exhibitor. Booth Number: F36. Country: GERMANY. Animal Health: Animal Health. Contract Services - Analytical & Lab Services: Quality Control Testing. Contract Services - Contract Services: Contract packaging. Excipients: Flavours and Perfumes, Sweetening Agents. Laboratory and Analytical Equipment: Bioanalysis Laboratory data systems and documentation. Natural Extracts: Dietary supplement ingredients, Herbal extracts, Nutraceutical and cosmeceutical ingredients. Pharmaceutical Machinery & Technology: Dermatologicals. Additional Natural Extracts: Cosmeceutical Ingredients.\"},{\"S No\":null,\"Name\":\"Chic Wu\",\"Title\":\"Sales Manager\",\"Company\":\"INORA Pharmaceutical Machinery Co., Ltd.\",\"Company Info\\/Profile Info\":\"INORA is a Taiwanese leading manufacturer of granulation equipment founded in 2007. Main products include HSM high shear mixer granulator, FBD fluid bed dryer, Dry granulator roller compactor, Bin blender, Tablet coater, High rotary atomizer spray dryer.\",\"Other Details\":\"Exhibitor. Booth Number: C54. Country: TAIWAN.\"},{\"S No\":null,\"Name\":\"Chen Zhongdong\",\"Title\":\"Manager\",\"Company\":\"NANJING JOYIN PHARMACHEM CO., LTD.\",\"Company Info\\/Profile Info\":\"Nanjing Joyin Pharmachem Co., Ltd is dedicated to be a professional supplier of various pharmaceutical intermediates, APIs as well as other special chemicals. We are also professional on Customer Synthesis\\/Contract Manufacturing service under cGMP based on confidential agreement with our clients.\",\"Other Details\":\"Exhibitor. Booth Number: G04B. Country: CHINA. Custom Manufacturing: Custom Manufacturing (general category); Custom Manufacturing\\/Exclusive Synthesis of Fine Chemicals. Generic APIs: Generic Alkaloids, Generic Antibiotic, Generic Antineoplastic \\/ Chemotherapeutic agent \\/ Anthracyclines, Generic Hormones and Synthetic Substances, Generic Peptides, Generic Prostaglandines. Intermediates, Fine and Specialty Chemicals: Advanced Intermediates, Fine Chemicals (general category), Regulated Fine Chemicals.\"},{\"S No\":null,\"Name\":\"Chunxia Tian\",\"Title\":\"Director of International Trade\",\"Company\":\"SICHUAN XIELI PHARMACEUTICAL CO., LTD\",\"Company Info\\/Profile Info\":\"Sichuan Xieli Pharmaceutical Co., Ltd, founded in the early 1980s, specializes in the cultivation of Chinese herbal medicines, extraction of natural active research ingredients, synthesis of derivatives, and research and development. They also produce APIs, extracts, and intermediates, and provide API R&D and sound field CDMO services.\",\"Other Details\":\"Exhibitor. Booth Number: K27. Country: CHINA. Biopharmaceuticals: Antibody Drug Conjugates (ADCs), Antibodies, Biopharmaceuticals (general category), Biosimilars, Critical quality attributes, Expression platforms, Medicinal chemistry, Platform technologies, Tech transfer and Scale up.\"},{\"S No\":null,\"Name\":\"Chiho Okada\",\"Title\":\"Staff\",\"Company\":\"NIPRO CORPORATION\",\"Company Info\\/Profile Info\":\"Nipro Corporation's PharmaPackaging Division specializes in providing customized solutions for the pharmaceutical industry, including bags, tubing, glass packaging, syringes, vials, and medical devices.\",\"Other Details\":\"Exhibitor. Booth Number: E20. Country: JAPAN. Pharmaceutical Packaging: Bags and tubing, Glass Packaging, Medical Devices and medical packaging, Packaging Materials and Components, Plastic Packaging, Primary Packaging, Syringes\\/prefilled syringes, Vials \\/ Ampuls.\"},{\"S No\":null,\"Name\":\"Cizlie Sunto\",\"Title\":\"Industry Relations Manager\",\"Company\":\"Parenteral Drug Association ( PDA APAC)\",\"Company Info\\/Profile Info\":\"The Parenteral Drug Association (PDA) is a global nonprofit organization focused on advancing pharmaceutical and biopharmaceutical manufacturing science and regulation. They provide science, technology, and regulatory information to enhance patient care.\",\"Other Details\":\"Exhibitor. Booth Number: P53. Country: SINGAPORE. Biopharmaceuticals: Others.\"},{\"S No\":null,\"Name\":\"Dandan Ding\",\"Title\":\"Sales\",\"Company\":\"Hubei Sanjing Biotechnology Co.,Ltd.\",\"Company Info\\/Profile Info\":\"Hubei Sanjing Biotechnology Co.,Ltd. is a manufacturer of steroid raw materials, mainly engaged in API and intermediates production and research and development. We have business with many pharmaceutical manufacturers and traders at home and abroad.\",\"Other Details\":\"Exhibitor. Booth Number: M58. Country: CHINA. Contract Services - Bio Services: Medicinal chemistry. Contract Services - Contract Services: Contract manufacturing. Excipients: Capsules\\/Encapsulation. Finished Dosage Forms: Capsules. Intermediates, Fine and Specialty Chemicals: Fine Chemicals (general category). Natural Extracts: Nutraceutical and cosmeceutical ingredients. Pharmaceutical Packaging: Packaging Materials and Components. Pharmaceutical Machinery & Technology: Alimentary Tract and Metabolism.\"},{\"S No\":null,\"Name\":\"Darshan Shah\",\"Title\":\"HEAD-COMMERCIAL\",\"Company\":\"Nishchem International PVT LTD\",\"Company Info\\/Profile Info\":\"Nishchem International PVT LTD\",\"Other Details\":\"Exhibitor. Booth Number: K36. Country: INDIA.\"},{\"S No\":null,\"Name\":\"David Qiu\",\"Title\":\"Manager\",\"Company\":\"GUANGDONG DFP NEW MATERIAL GROUP CO., LTD\",\"Company Info\\/Profile Info\":\"Dongfeng Group has been committed to the development of the printing and packaging industry since its establishment on December 30, 1983. In the field of new energy, the company is committed to researching and producing sustainable energy products, promoting the development of clean energy focuses on the research and production of high-performance for various industries.\",\"Other Details\":\"Exhibitor. Booth Number: D52. Country: CHINA. Pharmaceutical Packaging: Glass Packaging, Packaging Materials and Components, Plastic Packaging.\"},{\"S No\":null,\"Name\":\"Divya Jain\",\"Title\":\"DIRECTOR\",\"Company\":\"K A Malle Pharmaceuticals Ltd.\",\"Company Info\\/Profile Info\":\"We are manufacturer of APIs namely Albendazole & Mebendazole. Our manufacturing facility adheres to the highest quality standards. Our team of experienced scientists and technicians work to ensure the highest level of purity in our products. We have experience of 3 Decades and expertise in the API manufacturing, We have established good partnership with leading Pharmaceutical Companies Worldwide.\",\"Other Details\":\"Exhibitor. Booth Number: L45. Country: INDIA.\"},{\"S No\":null,\"Name\":\"Dohyung Kim\",\"Title\":\"President\",\"Company\":\"Careplusone Co., Ltd.\",\"Company Info\\/Profile Info\":\"CAREPLUSONE CO., LTD, have been trying to get closer to our customers with valuable products and information that give a healthy life required in a new generation. We have offered various medicines, medical devices and functional healthcare products, cosmetics to our customers quickly and also we have kept a reliable to a better quality of life than now by providing innovative products.\",\"Other Details\":\"Exhibitor. Booth Number: M27. Country: SOUTH KOREA. Finished Dosage Forms: Capsules; Creams \\/ Lotions \\/ Ointments; Gel caps; Injectables; Ointments; Soft tabs; Sprays; Syrups; Tablets.\"},{\"S No\":null,\"Name\":\"Dr. Akrapon Kurusarttra\",\"Title\":\"Assistant Director General of the Department of Health Service Support and Director of the Bureau of Medical Hub Industrial Promotion\",\"Company\":\"Department Of Health Service Support, Ministry of Public Health\",\"Company Info\\/Profile Info\":null,\"Other Details\":\"Exhibitor. Booth Number: M20. Country: THAILAND.\"},{\"S No\":null,\"Name\":\"DR. VISHAL SHANKHAVARA\",\"Title\":\"DIRECTOR\",\"Company\":\"Nira Life Sciences Private Limited\",\"Company Info\\/Profile Info\":\"A WHO-GMP-approved Indian leading manufacturing company of APIs [Bulk Drugs], Our state-of-the-art manufacturing facilities has an EUWC, Halal certificate, GMP, GLP and ISO 9001:2015. India's Largest Manufacturer of Mefenamic Acid.\",\"Other Details\":\"Exhibitor. Booth Number: L21. Country: INDIA. Animal Health: Animal Health. Generic APIs: ANALGESIC, ANTI - DIABETES, ANTI - DIHERIAL, ANTI - FUNGAL, Generic Antibiotic, NSAID, SULFONYLAREA.\"},{\"S No\":null,\"Name\":\"Duangta Urasilp\",\"Title\":\"Sales & Marketing Manager\",\"Company\":\"SPD Biotech Co.,Ltd.\",\"Company Info\\/Profile Info\":\"Science and Pharmaceutical equipment \\/ Consumable products. Consultant services for Pharmaceutical and Biotechnology Solutions.\",\"Other Details\":\"Exhibitor. Booth Number: F43. Country: THAILAND. Biopharmaceuticals: Biomanufacturing, Bio process technologies, Biopharmaceuticals (general category), Biosimilars, Cell and Gene therapy, Cell biology, Downstream, Monoclonal Antibodies, Tissue Culture Medias, Upstream, Viral Clearance. Contract Services - Analytical & Lab Services: Chromatography.\"},{\"S No\":null,\"Name\":\"Echo Li\",\"Title\":\"Sales Director\",\"Company\":\"SICHUAN DEEBIO PHARMACEUTICAL CO., LTD\",\"Company Info\\/Profile Info\":\"Sichuan Deebiotech Co.,Ltd is a global advanced bio-enzyme manufacturer with strong R&D capability. We are also an EUGMP company since 2005 and manufacturing enzymes with high activity, high purity, and high stability. Our products have been exported to over 30 countries and regions such as Europe, North America, Japan, and South Korea.\",\"Other Details\":\"Exhibitor. Booth Number: G08. Country: CHINA.\"},{\"S No\":null,\"Name\":\"Elena Korolova\",\"Title\":\"Import\\/export manager\",\"Company\":\"JSC Lekhim\",\"Company Info\\/Profile Info\":\"Lekhim Group of Pharmaceutical Companies is a powerful modern high-tech manufacturing company, one of the leading pharmaceutical companies of Ukraine on the development, manufacture and sale of high-quality and affordable medicines. Annually the Group registers about 10 new products manufactured according to the advanced technologies.\",\"Other Details\":\"Exhibitor. Booth Number: M42. Country: UKRAINE. Animal Health: Animal Health. Contract Services - Contract Services: Contract manufacturing, Formulation development. Custom Manufacturing: Custom Manufacturing of Dosage Form Drugs. Finished Dosage Forms: Capsules, Injectables, Lotions, Powders, Sprays, Suppositories, Syrups, Tablets.\"},{\"S No\":null,\"Name\":\"Emma Li\",\"Title\":\"15F, Building J, Zendai Himalayas Center, No. 9 Liuchao Road, Yuhuatai District, 210012 NANJING JIANGSU\",\"Company\":\"Nanjing Dorra Pharmaceutical Technology Co.,Ltd.\",\"Company Info\\/Profile Info\":\"Dorrapharma is engaged in R&D, manufacture and market of intermediates, APIs (Active Pharmaceutical Ingredients) and formulations. They specialize in bromination, enzyme\\/metal-catalyzed reactions, nitration, and hydrogenation, holding multiple core patents for invention.\",\"Other Details\":\"Exhibitor. Booth Number: H24. Country: CHINA. Animal Health: Animal Health. Contract Services - Contract Services: Contract manufacturing. Custom Manufacturing: API Contract Manufacturing. Natural Extracts: Herbal extracts, Plant extracts.\"},{\"S No\":null,\"Name\":\"Eva Tang\",\"Title\":\"Manager\",\"Company\":\"Sichuan Huiyu Pharmaceutical Co.,Ltd.\",\"Company Info\\/Profile Info\":\"Established in 2010, Sichuan Huiyu Pharmaceutical Co., Ltd. focuses on the research, development, production, and sales of drugs and complex injections for tumor treatment. They are headquartered in Neijiang, Economic Development Zone, with an R&D center in Chengdu.\",\"Other Details\":\"Exhibitor. Booth Number: M26. Country: CHINA. Biopharmaceuticals: Biopharmaceuticals (general category), Biosimilars, Molecular Biology. Custom Manufacturing: API Contract Manufacturing, Custom Manufacturing of Dosage Form Drugs. Finished Dosage Forms: Injectables, Out-licensing, Powders. Generic APIs: Generic Antineoplastic \\/ Chemotherapeutic agent \\/ Anthracyclines. Pharmaceutical Machinery & Technology: Cardiovascular system.\"},{\"S No\":null,\"Name\":\"Eve Wang\",\"Title\":\"Sales Director\",\"Company\":\"Shanghai Haishun New Pharmaceutical Packaging Co., Ltd\",\"Company Info\\/Profile Info\":\"Shanghai Haishun New Pharmaceutical Packaging Co., Ltd, part of Hysum Group, is the largest manufacturer of pharmaceutical packaging in China. They specialize in alu alu foil, blister foil, laminated foil, PVC, PVDC, plastic films, plastic bottles, and all types of packaging. Hysum Group holds 80% of the market share in China and exports to over 30 countries, providing packaging solutions worldwide.\",\"Other Details\":\"Exhibitor. Booth Number: D36. Country: CHINA. Pharmaceutical Packaging: Alu alu foil, blister foil, laminated foil, PVC, PVDC, plastic films, plastic bottles, comprehensive packaging solutions.\"},{\"S No\":null,\"Name\":\"Fakai Cao\",\"Title\":\"Sales\",\"Company\":\"Xinxiang Aurora Biotechnology Co., Ltd.\",\"Company Info\\/Profile Info\":\"Xinxiang Aurora Biotechnology Co., Ltd. specializes in the development, production, sales, and service of bio-engineering products. They focus on fine chemicals, pharmaceutical intermediates, optoelectronic materials, and water purification materials.\",\"Other Details\":\"Exhibitor. Booth Number: Q41. Country: CHINA. Product Range: Fine chemicals, pharmaceutical intermediates, optoelectronic materials, water purification materials.\"},{\"S No\":null,\"Name\":\"Feby Jia\",\"Title\":null,\"Company\":\"Shanghai Weiyuxi Biotechnology Co., Ltd.\",\"Company Info\\/Profile Info\":\"Shanghai WayxBio Co., Ltd. integrates the production of finished API products, peptide synthesis and modification technology, chromatographic purification process R&D, pharmaceutical equipment manufacturing, and related consumables supply.\",\"Other Details\":\"Exhibitor. Booth Number: H20. Country: CHINA. Product Range: Biopharmaceuticals, peptides. Contract Services: Analytical & Lab Services (Chromatography, Method Development, Validation), Bio Services, Contract Services (Analytical development, Chemical synthesis, Lyophilisation), Generic APIs (Peptides).\"},{\"S No\":null,\"Name\":\"Flavio Gallocchio\",\"Title\":\"President of the Board\",\"Company\":\"Dott. Bonapace & C. SRL\",\"Company Info\\/Profile Info\":\"Since 1946, Dott. Bonapace & C. SRL has been manufacturing small equipment for R&D in the pharmaceutical industry, including capsule filling machines, tablet presses, suppository lines, checkweighers, and other equipment.\",\"Other Details\":\"Exhibitor. Booth Number: A01. Country: ITALY. Product Range: Pharmaceutical Machinery & Technology (Lab scale equipment for capsules, tablets, and suppositories).\"},{\"S No\":null,\"Name\":\"Florence BEYAERT\",\"Title\":\"Sales Manager Asia\\/Pacific \\u2013 Pharma Division\",\"Company\":\"Technoflex\",\"Company Info\\/Profile Info\":\"With nearly 50 years of experience, Technoflex is the European leader in designing and manufacturing flexible bags for the pharmaceutical industry. Their products include Inerta\\u00ae, Biocell\\u00ae, Cryocell\\u00ae, SafeCell\\u00ae, Dual-Mix\\u00ae, and ReadyMix\\u00ae bags, tailored for Cell Therapies, Biotherapies, IV Therapies, and Compounding. All bags comply with European and American pharmacopoeias.\",\"Other Details\":\"Exhibitor. Booth Number: B40. Country: FRANCE. Product Range: Pharmaceutical Packaging (Aluminium Foils, Bags and tubing, Drug Delivery Systems, Medical Devices, Packaging Materials and Components, Parenteral Containers, Pharmaceutical Pouches, Plastic Packaging, Primary Packaging, Secondary Packaging, Sustainable Packaging).\"},{\"S No\":null,\"Name\":\"Gaeun Chu\",\"Title\":\"Associate, Global Sales\",\"Company\":\"Prestige Biologics Co.,Ltd.\",\"Company Info\\/Profile Info\":\"Prestige Biologics is a Korea-based CDMO specializing in manufacturing antibody molecules from mammalian cells. They offer capabilities in process development, analytical methods, and clinical\\/commercial manufacture with 154,000L combined bioreactor volume.\",\"Other Details\":\"Exhibitor. Booth Number: L26. Country: SOUTH KOREA. Product Focus: Biopharmaceuticals (Antibodies, Biomanufacturing, Biosimilars). Contract Services include Analytical & Lab Services (Chromatography, Method Development, Validation, QC Testing, Stability Testing), Bio Services, Contract Packaging, and Custom Manufacturing.\"},{\"S No\":null,\"Name\":\"Gayeun Lee\",\"Title\":\"Staff\",\"Company\":\"LACTOMASON CO., LTD.\",\"Company Info\\/Profile Info\":\"LactoMason specializes in research, development, and manufacture of probiotics. They provide probiotic raw materials, probiotic products, and finished product OEM services. Committed to tailored client solutions.\",\"Other Details\":\"Exhibitor. Booth Number: L28. Country: SOUTH KOREA. Product Focus: Finished Dosage Forms (Capsules, Powders, Tablets, Probiotics, Health Supplements).\"},{\"S No\":null,\"Name\":\"Gao Ying\",\"Title\":\"Manager\",\"Company\":\"JINZHOU BENTIAN PHARMACEUTICAL CO., LTD\",\"Company Info\\/Profile Info\":\"Jinzhou Bentian Pharmaceutical Co., Ltd. is a modern pharmaceutical company specializing in tablets, capsules, granules, powders, solutions, ointments, syrups, and more. Integrates scientific research, production, and sales.\",\"Other Details\":\"Exhibitor. Booth Number: P20. Country: CHINA. Product Range: Custom Manufacturing (Dosage Form Drugs, Fine Chemicals), Excipients (Capsules, Ointments, Suppositories), Finished Dosage Forms (Capsules, Injectables, Ointments, Powders, Suppositories), Intermediates.\"},{\"S No\":null,\"Name\":\"Govind Yadav\",\"Title\":\"Sr. Marketing Executive\",\"Company\":\"ACG ASSOCIATED CAPSULES PVT.LTD.\",\"Company Info\\/Profile Info\":\"ACG is the largest integrated supplier to the world\\u2019s solid dosage manufacturing industry, offering empty hard shell capsules, packaging materials, traceability solutions, and machinery.\",\"Other Details\":\"Exhibitor. Booth Number: Q02. Country: INDIA. Product Range: Custom Manufacturing (Dosage Form Drugs), Excipients (Capsules\\/Encapsulation), Natural Extracts (Nutraceutical and cosmeceutical ingredients), Pharmaceutical Packaging.\"},{\"S No\":null,\"Name\":\"Giulia Borzumati\",\"Title\":\"Marketing Manager\",\"Company\":\"Innate S.r.l.\",\"Company Info\\/Profile Info\":\"Innate is an Italian manufacturing company established in 2004, specializing in medical devices (class IIa, IIb and III), cosmetics, and food supplements in Orthopedics, Aesthetic medicine, and Gynecology fields.\",\"Other Details\":\"Exhibitor. Booth Number: F44. Country: ITALY. Product Range: Finished Dosage Forms (Capsules, Creams \\/ Lotions \\/ Ointments, Injectables, Suppositories).\"},{\"S No\":null,\"Name\":\"Haiping Wu\",\"Title\":\"Sales Manager\",\"Company\":\"XIAMEN BIOENDO TECHNOLOGY CO., LTD\",\"Company Info\\/Profile Info\":\"Bioendo specializes in sustainable bacterial endotoxin testing solutions.\",\"Other Details\":\"Exhibitor. Booth Number: J36. Country: CHINA. Product Range: Biopharmaceuticals (Bioreactors and Fermentation). Contract Services: Pre Clinical Trials, Clinical Trials Stages 1-4, CRO, Clinical Data.\"},{\"S No\":null,\"Name\":\"Haiyong Lv\",\"Title\":\"(No specific title mentioned)\",\"Company\":\"ZHEJIANG KEXING AUTOMATIC EQUIPMENT CO., LTD\",\"Company Info\\/Profile Info\":\"Specializes in the production of internal finned heat exchangers, spiral-wound heat exchangers, as well as supporting instruments such as magnetic flap level meters and temperature transmitters.\",\"Other Details\":\"Exhibitor. Booth Number: L72. Country: CHINA. Product Range: Biopharmaceuticals (general category), Medicinal chemistry, Others. Contract Services: Contract manufacturing, Others. Laboratory and Analytical Equipment: Others.\"},{\"S No\":null,\"Name\":\"Hanqiao Xia\",\"Title\":\"Vice General Manager\",\"Company\":\"YINGCHENG HENGTIAN PHARMACEUTICAL PACKAGING CO., LTD\",\"Company Info\\/Profile Info\":\"Founded in the 1990s and located in Yingcheng City, Hubei Province, China, YINGCHENG HENGTIAN PHARMACEUTICAL PACKAGING CO., LTD is a modern company specializing in advanced pharmaceutical packaging. They produce elastomer seals, aluminum-plastic combination caps, and non-PVC multilayer co-extruded films for infusion. The company meets standards including Chinese Pharmacopoeia, USP, EP, and ISO series. They have extensive product registration and DMF documents with the US FDA and EU registration records for sale.\",\"Other Details\":\"Exhibitor. Booth Number: D56. Country: CHINA. Product Range: Pharmaceutical Packaging including closures, drug delivery systems, medical devices, parenteral containers, plastic packaging, primary packaging, syringes\\/prefilled syringes.\"},{\"S No\":null,\"Name\":\"Han Wu\",\"Title\":\"Manager\",\"Company\":\"Bloomage Biotechnology Corporation Limited\",\"Company Info\\/Profile Info\":\"Established in 2000, Bloomage Biotech specializes in hyaluronic acid production through microbial fermentation. Over 20 years, they've grown into a global leader in biotechnology and biomaterials, focusing on enhancing quality of life through healthier experiences.\",\"Other Details\":\"Exhibitor. Booth Number: P19. Country: CHINA. Product Focus: Biopharmaceuticals, specifically biomanufacturing.\"},{\"S No\":null,\"Name\":\"Harald Mullens\",\"Title\":\"Sales Director APAC\",\"Company\":\"CurTec Asia Pacific\",\"Company Info\\/Profile Info\":\"CurTec specializes in high-performance plastic packaging solutions for pharmaceuticals and specialty chemicals. Their products include drums, pails, and jars aimed at enhancing product value and sustainability.\",\"Other Details\":\"Exhibitor. Booth Number: N41. Country: SINGAPORE. Product Focus: Pharmaceutical Packaging, including plastic primary and secondary packaging, and sustainable packaging.\"},{\"S No\":null,\"Name\":\"HeQi Tong\",\"Title\":\"Sales Manager\",\"Company\":\"Hangzhou Maytime Bio-tech Co., Ltd\",\"Company Info\\/Profile Info\":\"Hangzhou Maytime Bio-tech Co., Ltd is a manufacturer specializing in various APIs (Active Pharmaceutical Ingredients) and intermediates.\",\"Other Details\":\"Exhibitor. Booth Number: P21. Country: CHINA. Product Focus: Animal Health, Generic APIs, Natural Extracts including animal extracts and cosmeceutical ingredients.\"},{\"S No\":null,\"Name\":\"Hualei Shi\",\"Title\":\"Sales Manager\",\"Company\":\"Shandong Ujoin Medical Technology Co., Ltd.\",\"Company Info\\/Profile Info\":\"Shandong Ujoin Medical Technology Co., Ltd., established in 2009, specializes in producing pharmaceutical packaging materials, medical instruments, medical consumables, and food packaging materials.\",\"Other Details\":\"Exhibitor. Booth Number: C51. Country: CHINA. Product Focus: Pharmaceutical Packaging including aluminium foils, bags, tubing, medical devices, plastic packaging, and more.\"},{\"S No\":null,\"Name\":\"Huang Mulan\",\"Title\":\"Manager\",\"Company\":\"GENOHOPE BIOTECH LTD\",\"Company Info\\/Profile Info\":\"Established in 2019, GENOHOPE BIOTECH LTD is a joint venture by Genovior Biotech Corporation and New Hope Group, focusing on Contract Injectable Drug Manufacturing in China. Specializes in Diabetes & Obesity and Oncology products.\",\"Other Details\":\"Exhibitor. Booth Number: H41. Country: CHINA. Product Focus: Contract Injectable Drug Manufacturing.\"},{\"S No\":null,\"Name\":\"Irene Zhao\",\"Title\":\"Manager\",\"Company\":\"JIANGSU SIMCERE PHARMACEUTICAL CO.,LTD\",\"Company Info\\/Profile Info\":\"Established in 1995, JIANGSU SIMCERE PHARMACEUTICAL CO.,LTD is an R&D-driven pharmaceutical company with a portfolio focusing on Oncology, Neurology, Autoimmune, and Anti-infection. Also involved in CMO business.\",\"Other Details\":\"Exhibitor. Booth Number: H07. Country: CHINA. Product Focus: Pharmaceuticals in multiple therapeutic areas.\"},{\"S No\":null,\"Name\":\"Jacqueline Ng\",\"Title\":\"Business Development Manager\",\"Company\":\"Wai Fat Pharmaceutical Company Limited\",\"Company Info\\/Profile Info\":\"Founded in 1982, Wai Fat Pharmaceutical Co., Ltd. acts as a wholesaler and distributor, supplying products to pharmacies & drug stores in Hong Kong & Macau. Offers OEM services. Famous brands include \\u201cZihua Embrocation\\u00ae\\u201d & \\u201cDing Ding Mosquito\\u00ae\\u201d.\",\"Other Details\":\"Exhibitor. Booth Number: M54. Country: HONG KONG. Product Focus: Custom manufacturing of drugs, lotions, ointments. Natural extracts.\"},{\"S No\":null,\"Name\":\"Jarod Yang\",\"Title\":\"Vice General Manager\",\"Company\":\"Chongqing Chinabase Star Import & Export Co., Ltd\",\"Company Info\\/Profile Info\":\"Established joint-stock company since 1999. Authenticated with ISO9001:2008 QMS. Subsidiaries include Tai Wo (HK) International Trading Limited and others.\",\"Other Details\":\"Exhibitor. Booth Number: Q57. Country: CHINA. Product Focus: API contract manufacturing, cosmeceutical ingredients.\"},{\"S No\":null,\"Name\":\"Jennifer Zhang\",\"Title\":\"Sales Manager\",\"Company\":\"CHANGZHOU QIANHONG BIO-PHARMA CO., LTD.\",\"Company Info\\/Profile Info\":\"Leading manufacturer and distributor of polysaccharide and protease drugs. Listed on the Shenzhen Stock Exchange. Main products: kallidinogenase series, heparin sodium, low molecular weight heparin series, compound digestive enzyme preparations, asparaginase series.\",\"Other Details\":\"Exhibitor. Booth Number: M69. Country: CHINA. Product Focus: Biomanufacturing, biosimilars, contract manufacturing, custom manufacturing of dosage form drugs.\"},{\"S No\":null,\"Name\":\"Jenny (Hyounjin) Bae\",\"Title\":\"Staff\",\"Company\":\"BCWorld Pharm. Co.,Ltd.\",\"Company Info\\/Profile Info\":\"Technology-driven pharmaceutical company in Korea. Expertise in formulation and process development. Certified as Korea Innovative Pharmaceutical Company (KIPC) and designated as Advanced Technology Center (ATC) by Korea Ministry of Knowledge Economy.\",\"Other Details\":\"Exhibitor. Booth Number: M21. Country: SOUTH KOREA. Product Focus: Finished dosage forms including capsules, injectables, powders, tablets; generic APIs such as generic antibiotics.\"},{\"S No\":null,\"Name\":\"Jenny Sun\",\"Title\":\"Foreign Trade Manager\",\"Company\":\"Jiangsu Fuxinhuakang Packaging Material Co., Ltd\",\"Company Info\\/Profile Info\":\"Professional factory since 1990 specializing in medicine packaging materials. Provides a wide range of packaging materials for solid and liquid pharmaceutical packing, including PVC sheet, PVC\\/PVDC film, PVC\\/PE film, PVC\\/PE\\/PVDC film, and aluminum foil. ISO15378 and ISO9001 certified.\",\"Other Details\":\"Exhibitor. Booth Number: E53. Country: CHINA. Product Focus: Pharmaceutical packaging materials including aluminium foils, drug delivery systems, medical devices, and packaging materials and compo\"},{\"S No\":null,\"Name\":\"Jesse Li\",\"Title\":\"Sales Support\",\"Company\":\"RENOLIT HEALTHCARE BEIJING\",\"Company Info\\/Profile Info\":\"Part of the RENOLIT Group, specializing in high-quality plastic films, sheets, and other plastic products. Operates globally with numerous production sites and sales entities.\",\"Other Details\":\"Exhibitor. Booth Number: C42. Country: CHINA. Product Focus: Biopharmaceuticals including bio process technologies. Pharmaceutical packaging such as bags, tubing, closures, and various plastic packaging solutions.\"},{\"S No\":null,\"Name\":\"Ji Chen\",\"Title\":\"Regional Manager\",\"Company\":\"SHANDONG LUKANG PHARMACEUTICAL CO., LTD\",\"Company Info\\/Profile Info\":\"Established in 1966, Lukang Pharma is a leading vertically integrated pharmaceutical enterprise in China. Specializes in API and Finished Dosage Forms for Human Drugs, Animal Health, and Bio-pesticides.\",\"Other Details\":\"Exhibitor. Booth Number: K29. Country: CHINA. Product Focus: Animal Health, Bio-pesticides, Generic APIs (Antibiotics), and Finished Dosage Forms (Capsules, Injectables, Powders, Tablets).\"},{\"S No\":null,\"Name\":\"Jignesh Akbari\",\"Title\":\"Director\",\"Company\":\"SNJ Labs Pvt. Ltd.\",\"Company Info\\/Profile Info\":\"SNJ Labs Pvt. Ltd. is India\\u2019s leading WHO-GMP certified manufacturer of various bulk drugs. They provide DMF and regulatory support for registration and ensure quality equivalent to Innovator's.\",\"Other Details\":\"Exhibitor. Booth Number: L19. Country: INDIA. Product Focus: Bulk Drugs.\"},{\"S No\":null,\"Name\":\"Jignesh Dave\",\"Title\":\"Marketing Manager\",\"Company\":\"Sohan Healthcare Pvt Ltd\",\"Company Info\\/Profile Info\":\"Sohan Healthcare Pvt Ltd is a manufacturing company established in 2005, specializing in APIs, DC Granules, Pellets, and Finished Formulations. Located in Kurkumbh, Maharashtra, India, it holds approvals from EU GMP and WHO GMP.\",\"Other Details\":\"Exhibitor. Booth Number: L25. Country: INDIA. Product Focus: APIs, DC Granules, Pellets, Formulations.\"},{\"S No\":null,\"Name\":\"Jin Hee Ahn\",\"Title\":\"Director of Global Business Team\",\"Company\":\"Medica Korea Co.,Ltd.\",\"Company Info\\/Profile Info\":\"Medica Korea Co., Ltd. was established in 1976. They export approximately 62 items to about 15 countries, manufactured according to GMP standards of the MFDS. They distribute mainly in clinics, hospitals, and pharmacies.\",\"Other Details\":\"Exhibitor. Booth Number: M25. Country: SOUTH KOREA. Product Focus: Finished Dosage Forms.\"},{\"S No\":null,\"Name\":\"Jintana Lapwet Srikong\",\"Title\":\"Marketing Director\",\"Company\":\"Unique Industrial Products Co.,Ltd.\",\"Company Info\\/Profile Info\":\"Unique Industrial Products Co.,Ltd. distributes globally recognized products: Domino\\/Bluhm Weber for TIJ printers, STILMAS for pharma PW WFI PSG systems, STERILINE for aseptic processing, LAST for infection control machines, and Optrel for inspection and leak testers.\",\"Other Details\":\"Exhibitor. Booth Number: E02. Country: THAILAND. Product Focus: Biopharmaceuticals, Contract Services, Custom Manufacturing, Pharmaceutical Packaging, Pharmaceutical Machinery & Technology.\"},{\"S No\":null,\"Name\":\"Jinwei Lyu\",\"Title\":\"Marketing Director\",\"Company\":\"ZHEJIANG LEPU PHARMACEUTICAL CO., LTD\",\"Company Info\\/Profile Info\":\"ZHEJIANG LEPU PHARMACEUTICAL CO., LTD, founded in 2001, specializes in anti-infection, anti-tumor, cardiovascular, nervous system drugs, located in Taizhou, Zhejiang.\",\"Other Details\":\"Exhibitor. Booth Number: Q29. Country: CHINA. Product Focus: Custom Manufacturing of APIs and Fine Chemicals.\"},{\"S No\":null,\"Name\":\"Jiwon Kim\",\"Title\":\"Sales Manager\",\"Company\":\"E-Cell Co.,Ltd.\",\"Company Info\\/Profile Info\":\"E-Cell Co., Ltd. specializes in manufacturing single-use bags & systems for biopharmaceuticals in South Korea.\",\"Other Details\":\"Exhibitor. Booth Number: L30. Country: SOUTH KOREA. Product Focus: Biopharmaceuticals and Custom Manufacturing.\"},{\"S No\":null,\"Name\":\"JIXIN QIAN\",\"Title\":\"CEO\",\"Company\":\"Chemyouth Life Science (Suzhou) Co., Ltd\",\"Company Info\\/Profile Info\":\"Chemyouth Life Science (Suzhou) Co., Ltd, based in Suzhou, China, focuses on R&D and production of nucleoside phosphoramidite monomers, ADC payloads, peptides, and custom synthesis of chemicals.\",\"Other Details\":\"Exhibitor. Booth Number: M67. Country: CHINA. Product Focus: Biopharmaceuticals and Custom Manufacturing.\"},{\"S No\":null,\"Name\":\"JOON HO KO\",\"Title\":\"GENERAL MANAGER\",\"Company\":\"Caregen Co.,Ltd.\",\"Company Info\\/Profile Info\":\"Caregen Co., Ltd. is a public biotech company established in 2001. It specializes in peptide platform technologies with over 712 global IPs, used in pharmaceuticals, nutraceuticals, medical devices, and cosmeceuticals.\",\"Other Details\":\"Exhibitor. Booth Number: L36. Country: SOUTH KOREA. Product Focus: Finished Dosage Forms and Natural Extracts.\"},{\"S No\":null,\"Name\":\"Julia Keller\",\"Title\":\"Marketing Manager\",\"Company\":\"hawo GmbH\",\"Company Info\\/Profile Info\":\"hawo GmbH, based in Germany, has been developing and producing sealing equipment since 1975. They focus on raising hygiene standards in medical and cleanroom industries with a range of products and services.\",\"Other Details\":\"Exhibitor. Booth Number: F36. Country: GERMANY. Product Focus: Pharmaceutical Packaging, including heat sealing systems, labeling, and sustainable packaging.\"},{\"S No\":null,\"Name\":\"Kamlesh Khokhani\",\"Title\":\"Managing Director\",\"Company\":\"Shamrock Pharmachemi Pvt. Ltd.\",\"Company Info\\/Profile Info\":\"SHAMROCK - YOUR RIGHT API PARTNER IN INDIA !! ShamrockPharmaGroup specializes in APIs, Intermediates, and Carbapenems with ownership of multiple manufacturing facilities.\",\"Other Details\":\"Exhibitor. Booth Number: G56. Country: INDIA. Product Focus: Animal Health, Biopharmaceuticals, Custom Manufacturing, Finished Dosage Forms, Generic APIs, Intermediates.\"},{\"S No\":null,\"Name\":\"Kanoknuch Chotipatoomwan\",\"Title\":\"Marketing Manager\",\"Company\":\"N.R. Industries Co.,Ltd.\",\"Company Info\\/Profile Info\":\"N.R. Industries, established in 1977, manufactures pharmaceutical machinery and accessories, meeting international standards.\",\"Other Details\":\"Exhibitor. Booth Number: E36. Country: THAILAND. Product Focus: Finished Dosage Forms, Pharmaceutical Packaging, Pharmaceutical Machinery & Technology.\"},{\"S No\":null,\"Name\":\"Kapil Singla\",\"Title\":\"Director\",\"Company\":\"Belco Pharma\",\"Company Info\\/Profile Info\":\"Belco Pharma, nearly 5 decades old, manufactures pharmaceutical formulations in Delhi, India. PIC\\/s and WHO GMP certified, exporting to over 25 countries.\",\"Other Details\":\"Exhibitor. Booth Number: K42. Country: INDIA. Product Focus: Finished Dosage Forms.\"},{\"S No\":null,\"Name\":\"Karuna Chinthanom\",\"Title\":\"Editor in Chief\",\"Company\":\"Media Matter Co., Ltd.\",\"Company Info\\/Profile Info\":\"Media Matter Co., Ltd.\",\"Other Details\":\"Exhibitor. Booth Number: E38. Country: THAILAND.\"},{\"S No\":null,\"Name\":\"Katherine Kum\",\"Title\":\"Marketing Manager\",\"Company\":\"Benton Dickinson Holdings Pte Ltd\",\"Company Info\\/Profile Info\":\"The BD Medical segment focuses on innovative solutions for infection prevention, drug delivery, surgical procedures, and medication management. Customers include hospitals, clinics, healthcare workers, pharmacies, and biotech companies.\",\"Other Details\":\"Exhibitor. Booth Number: E08. Country: SINGAPORE.\"},{\"S No\":null,\"Name\":\"KC TAI\",\"Title\":\"Manager\",\"Company\":\"TUBEPAC Sdn.Bhd.\",\"Company Info\\/Profile Info\":\"TUBEPAC specializes in aluminium collapsible tube manufacturing in Malaysia, serving international and local markets.\",\"Other Details\":\"Exhibitor. Booth Number: D38. Country: MALAYSIA.\"},{\"S No\":null,\"Name\":\"Keren Yao\",\"Title\":\"Manager\",\"Company\":\"HUAREN PHARMACEUTICAL CO., LTD\",\"Company Info\\/Profile Info\":\"Huaren Pharmaceutical, founded in 1998, integrates R&D, production, and sales of pharmaceuticals, healthcare, medical devices, and services. Listed on Shenzhen Stock Exchange.\",\"Other Details\":\"Exhibitor. Booth Number: K37. Country: CHINA.\"},{\"S No\":null,\"Name\":\"K.M. Sakthivel\",\"Title\":\"Director\",\"Company\":\"INNOVATIVE HEALTHCARE INDIA PRIVATE LIMITED\",\"Company Info\\/Profile Info\":\"Innovative Healthcare India Pvt Ltd, WHO-GMP, ISO 9001-2015 & ISO 22000-2018 certified manufacturer of amino acids and natural extracts.\",\"Other Details\":\"Exhibitor. Booth Number: P52. Country: INDIA.\"},{\"S No\":null,\"Name\":\"Kunal Shah\",\"Title\":\"AGM - BD & Marketing\",\"Company\":\"TITAN LABORATORIES PRIVATE LIMITED\",\"Company Info\\/Profile Info\":\"Titan Laboratories Pvt Ltd, offering finished dosage formulations, API manufacturing, pellets, granules, and more.\",\"Other Details\":\"Exhibitor. Booth Number: N58. Country: INDIA.\"},{\"S No\":null,\"Name\":\"Kun Huang\",\"Title\":null,\"Company\":\"HUBEI HUMANWELL PHARMACEUTICAL EXCIPIENTS CO., LTD.\",\"Company Info\\/Profile Info\":null,\"Other Details\":\"Exhibitor. Booth Number: M55. Country: CHINA.\"}]"